Repository: GS90/ImageFlow
Catalog: po/*.po
Languages: it, ru

source: Video to animated images
it: Video in immagini animate
ru: Преобразование видео в анимацию

source: Golodnikov Sergey
ru: Голодников Сергей

source: This application is designed for converting videos into animated GIF and WebP images using the FFmpeg library.You can configure key parameters, such as the output image size, frame rate, applied filters (interpolation method, dithering mode), palette generation method, and the maximum number of colors.
it: Questa applicazione è progettata per convertire i video in GIF animate e immagini WebP utilizzando la libreria FFmpeg. È possibile configurare parametri chiave,come la dimensione dell'immagine di output, la frequenza dei fotogrammi, i filtri applicati (metodo di interpolazione, modalità di dithering), metodo di generazione della tavolozza e numero massimo di colori.
ru: Приложение предназначено для конвертации видео в анимированные изображения форматов GIF и WebP с использованием библиотеки FFmpeg. Оно предоставляет возможность настройки основных параметров, таких как разрешение конечного изображения, частота кадров, применяемые фильтры (метод интерполяции и режим дизеринга), способ создания палитры и максимальное количество её цветов.

source: Features:
it: Caratteristiche:
ru: Особенности:

source: All conversion parameters can be configured.
it: Tutti i parametri di conversione possono essere configurati.
ru: Все параметры конвертации могут быть настроены.

source: Time range selection option.
it: Opzione di selezione dell'intervallo di tempo.
ru: Возможность выбора временного диапазона.

source: Preview of the result.
it: Anteprima del risultato.
ru: Предварительный просмотр результата.

source: Support for many formats.
it: Supporto per molti formati.
ru: Поддержка множества форматов.

source: Intuitive and user-friendly interface.
it: Interfaccia intuitiva e facile da usare.
ru: Интуитивно понятный и удобный интерфейс.

source: ImageFlow in dark mode
it: ImageFlow in modalità scura
ru: ImageFlow, тёмная тема

source: ImageFlow in light mode
it: ImageFlow in modalità chiara
ru: ImageFlow, светлая тема

source: ImageFlow, preferences
it: ImageFlow, preferenze
ru: ImageFlow, настройки

source: Select «Start» or «End» and rewind the video to the desired frame, or enter the time in the corresponding field.
it: Seleziona «Inizio» o «Fine» e riavvolgi il video fino al fotogramma desiderato, oppure inserisci l'ora nel campo corrispondente.
ru: Выберите «Старт» или «Конец» и перемотайте видео до нужного кадра либо введите время в соответствующем поле.

source: Time format - hours:minutes:seconds.milliseconds (00:00:00.000)
it: Formato ora: ore:minuti:secondi.millisecondi (00:00:00.000)
ru: Формат времени - часы:минуты:секунды.миллисекунды (00:00:00.000)

source: Time format - minutes:seconds.milliseconds (00:00.000)
it: Formato ora: minuti:secondi.millisecondi (00:00.000)
ru: Формат времени - минуты:секунды.миллисекунды (00:00.000)

source: Time format - seconds.milliseconds (00.000)
it: Formato ora - secondi.millisecondi (00.000)
ru: Формат времени - секунды.миллисекунды (00.000)

# shortcut window
source: General
it: Generale
ru: Основные

# shortcut window
source: Open video file
it: Apri file video
ru: Открыть видеофайл

# shortcut window
source: Preferences
it: Preferenze
ru: Настройки

# shortcut window
source: Show Shortcuts
it: Mostra scorciatoie
ru: Показать сочетания клавиш

# shortcut window
source: Quit
it: Esci
ru: Выход

source: Start
it: Inizio
ru: Начало

source: End
it: Fine
ru: Конец

source: View a file externally
it: Ver un archivo externamente
ru: Просмотр во внешнем приложении

source: Open
it: Apri
ru: Открыть

source: Open video file
it: Apri file video
ru: Открыть видеофайл

source: Application menu
it: Menu applicazione
ru: Меню приложения

source: Loop
ru: Повтор

source: Video looping
it: Looping video
ru: Зацикливание видео

source: Trim
it: Taglia
ru: Обрезать

source: Select a time segment
it: Seleziona un segmento di tempo
ru: Выбрать временной отрезок

source: Original 4320p 2160p 1440p 1080p 720p 480p 360p User
it: Originale 4320p 2160p 1440p 1080p 720p 480p 360p Utente
ru: Исходное 4320p 2160p 1440p 1080p 720p 480p 360p Другое

source: Image size
it: Dimensione immagine
ru: изображения

source: Size
it: Dimensione
ru: Размер

source: Width
it: Larghezza
ru: Ширина

source: Height
it: Altezza
ru: Высота

source: Interpolation
it: Interpolazione
ru: интерполяции

source: Scaler
it: Ridimensionamento
ru: Метод

source: Keep aspect ratio
it: Mantieni proporzioni
ru: соотношение сторон

source: Ratio
it: Proporzioni
ru: Сохранить

source: Frames per second
it: Fotogrammi al secondo
ru: кадров

source: FPS
ru: Частота

source: Dithering mode
it: Modalità dithering
ru: дизеринга

source: Dither
it: Dithering
ru: Режим

source: Max colors
it: Colori massimi
ru: цветов в палитре

source: Palette
ru: Количество

source: Format
it: Formato
ru: Формат

source: Generate
it: Genera
ru: Генерировать

source: Preview
it: Anteprima
ru: Просмотр

source: Save
it: Salva
ru: Сохранить

source: _Preferences
it: _Preferenze
ru: _Настройки

source: _Keyboard Shortcuts
it: _Scorciatoie da tastiera
ru: _Сочетания клавиш

source: _About ImageFlow
it: _Informazioni su ImageFlow
ru: _О программе

source: Application
it: Applicazione
ru: Приложение

source: Light Dark
it: Chiaro Scuro
ru: Светлая Тёмная

source: Application color theme
it: Colore tema dell'applicazione
ru: Цветовая тема приложения

source: Theme
it: Tema
ru: Тема

source: Detect original file resolution
it: Rileva la risoluzione del file originale
ru: Определить исходное разрешение файла

source: Detect size
it: Rileva dimensione
ru: Определить размер

source: Generation
it: Elaborazione
ru: Обработка

source: Accurate rounding in interpolation
it: Arrotondamento preciso nell'interpolazione
ru: Точное округление при интерполяции

source: Accurate rounding
it: Arrotondamento accurato
ru: Точное округление

source: Statistics mode
it: Modalità statistica
ru: Режим статистики

source: Palette generation
it: Generazione di palette
ru: Генерация палитры

source: Crosshatch pattern visibility level
it: Livello di visibilità del pattern a tratteggio incrociato
ru: Уровень видимости перекрестной штриховки

source: Bayer scale
it: Scala Bayer
ru: Bayer, размер шаблона

source: Lossless compression method
it: Metodo di compressione senza perdita di dati
ru: Метод сжатия без потерь

source: Lossless
it: Compressione dati senza perdita
ru: Сжатие без потерь

source: Quality level
it: Livello di qualità
ru: Уровень качества

source: Quality
it: Qualità
ru: Качество

source: For lossy encoding, this controls image quality. For lossless encoding, this controls the effort and time spent in compression. Range is 0 to 100. Default is 75.
it: Per la codifica con perdita di dati, controlla la qualità dell'immagine. Per la codifica senza perdita di dati, controlla lo sforzo e il tempo impiegati nella compressione. L'intervallo è compreso tra 0 e 100.Il valore predefinito è 75.
ru: Для сжатия с потерями этот параметр управляет качеством изображения. При кодировании без потерь управляет трудозатратами и временем, затраченными на сжатие. Диапазон от 0 до 100. Значение по умолчанию 75.

source: Warning! This value overrides other settings
it: Attenzione! Questo valore sovrascrive le altre impostazioni.
ru: Внимание! Это значение переопределяет другие настройки

source: Preset
it: Preimpostato
ru: Предустановка

source: This does some automatic settings based on the general type of the image. None: Do not use a preset. Default: Use the encoder default. Picture: Digital picture, like portrait, inner shot. Photo: Outdoor photograph, with natural lighting. Drawing: Hand or line drawing, with high-contrast details. Icon: Small-sized colorful images. Text: Text-like.
it: Questa opzione esegue alcune impostazioni automatiche in base al tipo generale dell'immagine. Nessuno: non utilizzare un preset. Predefinito: utilizza l'impostazione predefinita del codificatore. Immagine: immagine digitale, come ritratto, scatto interno. Foto: fotografia in esterni, con luce naturale. Disegno: disegno a mano libera o a linee, con dettagli ad alto contrasto. Icona: immagini colorate di piccole dimensioni. Testo: simile al testo.
ru: Некоторые автоматические настройки в зависимости от общего типа изображения. None: Не использовать предустановку. Default: Использовать значение по умолчанию кодировщика. Picture: Цифровое изображение, например портрет или внутренний снимок. Photo: Уличная фотография с естественным освещением. Drawing: Ручной или контурный рисунок с высококонтрастными деталями. Icon: Небольшие цветные изображения. Text: Текстовые элементы.

source: Adjusts quality and speed tradeoff
it: Regola il compromesso tra qualità e velocità
ru: Регулирует соотношение качества и скорости

source: Compression level
it: Livello di compressione
ru: Уровень сжатия

source: For lossy, this is a quality/speed tradeoff. Higher values give better quality for a given size at the cost of increased encoding time. For lossless, this is a size/speed tradeoff. Higher values give smaller size at the cost of increased encoding time. More specifically, it controls the number of extra algorithms and compression tools used, and varies the combination of these tools. This maps to the method option in libwebp. The valid range is 0 to 6. Default is 4.
it: Per la compressione lossy, si tratta di un compromesso tra qualità e velocità. Valori più alti offrono una migliore qualità per una determinata dimensione, a scapito di un maggiore tempo di codifica.La compressione lossless, si tratta di un compromesso tra dimensione e velocità. Valori più alti offrono una dimensione inferiore,a scapito di un maggiore tempo di codifica. Più specificamente, controlla il numero di algoritmi e strumenti di compressione aggiuntivi utilizzati e varia la combinazione di questi strumenti. Questo corrisponde all'opzione del metodo in libwebp. L'intervallo valido è compreso tra 0 e 6. Il valore predefinito è 4.
ru: Для сжатия с потерями это соотношение качества и скорости. Высокие значения обеспечивают лучшее качество при заданном размере, но увеличивают время кодирования. Для сжатия без потерь это соотношение размера и скорости. Высокие значения обеспечивают меньший размер за счет увеличенного времени кодирования. Более конкретно, это регулирует количество дополнительных алгоритмов и инструментов сжатия, а также изменяет комбинацию этих инструментов. Это соответствует параметру метода в libwebp. Диапазон от 0 до 6. Значение по умолчанию 4.

source: Done, image size in MB:
it: Fatto, dimensione immagine in MB:
ru: Завершено, размер изображения (Мб):

source: Saved:
it: Salvato:
ru: Сохранено:

source: Show in Files
it: Mostra nei File
ru: Показать в файлах

source: Source
it: Sorgente
ru: Исходный код

source: Application for converting video files to high-quality animated images.
it: Applicazione per convertire file video in immagini animate di alta qualità.
ru: Приложение для преобразования видеофайлов в высококачественные анимированные изображения.

source: File not accessible
it: File non accessibile
ru: Файл недоступен

source: If you’re using Flatpak, verify file access permissions
it: Se stai utilizzando Flatpak, verifica i permessi di accesso ai file
ru: Если вы используете Flatpak, проверьте права доступа

source: video;converter;image;gif;webp
it: video;convertitore;immagine;gif;webp
